tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Platform built on V8 to build network applications
brew "node"
# Compiler for writing next generation JavaScript
brew "babel"
# Library for manipulating PNG images
brew "libpng"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# C++ template library for linear algebra
brew "eigen"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Implementation of Telnet and SSH
brew "putty"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Command-line display management utility
cask "cscreen"
